<script setup lang="ts">
    useHead({ title: 'Оферта' })
</script>

<template>
    <v-app class="bg">
        <v-container class="fill-height">
            <v-row justify="center">
                <v-col cols="12" md="8">
                    <v-card class="elevation-12">
                        <v-card-text>
                            <h1 class="text-h5 font-weight-bold mb-4 darken-3">ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h1>

                            <p class="text-caption text-grey mb-4">Версия от 01 августа 2024 г., вступает в силу с 1 августа 2024 г.</p>

                            <p class="mb-4">Настоящее Пользовательское соглашение (далее - «Соглашение») регулирует отношения между Индивидуальным предпринимателем Рудаковым Данилом Андреевичем (ИП Рудаков Д.А.), ОГРНИП 324595800072302 (далее - «Продавец»), и вами – неограниченным кругом физических лиц, которые желают использовать сервисы и услуги, предоставляемые Продавцом (далее - «Вы», «Клиент»).</p>

                            <p class="mb-4">Вам необходимо внимательно ознакомиться с настоящим Соглашением, которое является публичной офертой в соответствии со статьей 437 Гражданского кодекса РФ. В случае запуска Бота в сети Интернет, расположенного по адресу https://t.me/pennoe и пополнение Лицевого счета (далее Баланса), считается, что Вы полностью ознакомились с содержанием Соглашения и принимаете его полностью безоговорочно в соответствии со статьей 438 Гражданского кодекса РФ, подтверждаете факт заключения Сторонами настоящего Соглашения, а также своё намерение на использование сервисов и услуг Продавца.</p>
                            <p class="mb-4">Если Вы не принимаете настоящее Соглашение или не согласны с какими-либо условиями, указанными в Соглашении, просим Вас не запускать бот, не пополнять баланс бота и не использовать сервисы и услуги Продавца.</p>
                            <p class="mb-4">Если Продавцом были внесены какие-либо изменения в Соглашение, с которыми Вы не согласны, Вы обязаны прекратить использование сервисов и услуг Продавца.</p>

                            
                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>

                            <p class="mb-2"><span class="font-weight-semibold">Магазин</span> – Бот, выполняющий различные действия, автоматически или по определенной команде, доступ к которой обеспечивается посредством использования Бота; система для размещения информации о продаваемых товарах, её донесения до Клиентов, обработки заявок и продажи товаров. В рамках настоящего Соглашения понятия «Бот», «Сервис» и «Магазин» являются равносильными и трактуются аутентично по контексту Соглашения.</p>
                            <p class="mb-2"><span class="font-weight-semibold">Цифровой товар</span> – объект соглашения сторон, перечень наименований ассортимента, представленный в Ботах продавца. В рамках настоящего Соглашения понятия «Товар», «цифровая услуга» и «товар» являются равносильными и трактуются аутентично по контексту Оферты.</p>
                            <p class="mb-2"><span class="font-weight-semibold">Клиент</span> - Пользователь Бота в сети Интернет</p>
                            <p class="mb-2"><span class="font-weight-semibold">Бот</span> - один или несколько ботов в сети телеграм принадлежащих Продавцу:</p>

                            <ul class="pl-10 mb-4">
                                <li><a href="https://t.me/pennoe">https://t.me/pennoe</a></li>
                                <li><a href="https://t.me/mintroom_bot">https://t.me/mintroom_bot</a></li>
                            </ul>

                            <p class="mb-4">Список может как расширяться так и уменьшаться.</p>

                            <p class="mb-2"><span class="font-weight-semibold">Заказ</span> – решение Клиента заказать Товар в Магазине продавца посредством оплаты, является полным и безоговорочным акцептом Заказчиком настоящего Соглашения.</p>
                            <p class="mb-2"><span class="font-weight-semibold">Конклюдентные действия</span> — это поведение, которое выражает согласие с предложением контрагента заключить, изменить или расторгнуть соглашение. Действия состоят в полном или частичном выполнении условий, которые предложил контрагент.</p>
                        

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">1. ПРЕДМЕТ СОГЛАШЕНИЯ</h2>
                            <p class="mb-2">1.1. Продавец продает Товар в соответствии с действующим прейскурантом, размещенном в Магазине, а Клиент производит оплату и принимает Товар в соответствии с условиями настоящего Соглашения.</p>
                            <p class="mb-2">1.2. Наименование, количество, а также ассортимент Товара, его стоимость, порядок доставки и иные условия определяются на основании сведений Продавца при оформлении заявки Клиентом в Магазине</p>
                            <p class="mb-2">1.3. Акцепт настоящего Соглашения выражается в совершении конклюдентных действий, в частности:</p>

                            <ul class="pl-10 mb-4">
                                <li>запуск Бота и его дальнейшее использование,</li>
                                <li>запуск Бота и принятие пользовательского соглашения / условия о пользовании сервисом / публичной оферты,</li>
                                <li>пополнение баланса Бота Продавца, оформление Заказа, приобретения Товара или услуги.</li>
                            </ul>

                            <p class="mb-4">Данный перечень не является исчерпывающим, могут быть и другие действия, которые ясно выражают намерение лица принять предложение контрагента.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>

                            <h3 class="font-weight-semibold mt-4 mb-2">2.1. Права и обязанности Продавца:</h3>
                            <p class="mb-2">2.1.1. Продавец вправе требовать оплаты Товаров и их доставки в порядке и на условиях, предусмотренных Соглашением.</p>
                            <p class="mb-2">2.1.2. Продавец может отказать в заключении Соглашения на основании настоящей Оферты Клиенту в случаях недобросовестного поведения, свидетельствующих о заключении Клиентом Соглашения с целью злоупотребления правами, и отсутствии обычной экономической цели Соглашения — приобретения Товара.</p>
                            <p class="mb-2">2.1.3. Продавец имеет право в одностороннем порядке расторгнуть Соглашение, заключенное с Клиентом на условиях настоящей Оферты, в случае нарушения Пользователем его условий или по иным основаниям, предусмотренным действующим законодательством Российской Федерации, а также без дополнительного объяснения причин. В случае если на момент принудительного расторжения Соглашения Баланс Клиента имеет не Нулевой Баланс, Продавцу необходимо распорядиться остатком денежных средств, составляющим Баланс Учетной записи Клиента, направив Клиенту распоряжение (контакты указаны в Магазине) с указанием реквизитов принадлежащего ему банковского счета для перечисления денежных средств, составляющих Баланс Учетной записи Клиента. В случае предоставления Клиентом реквизитов нескольких принадлежащих ему банковских счетов для перечисления остатка денежных средств, Продавец оставляет за собой право осуществления перевода данного остатка на любой из указанных Пользователем банковский счет. Распоряжение направляется Продавцу с приложением документов, указанных в п.9.7. Оферты, подтверждающих право данного Клиента на указанные денежные средства, находящиеся на Балансе Учетной записи Клиента. Возврат Клиенту денежных средств, составляющих Баланс Учетной записи Клиента на момент расторжения Соглашения, осуществляется Продавцом в течение 45 (Сорока пяти) банковских дней с момента получения соответствующего письменного распоряжения Клиента.</p>
                            <p class="mb-2">2.1.4. Продавец обязуется передать Клиенту Товар надлежащего качества и в надлежащей упаковке.</p>
                            <p class="mb-2">2.1.5. Продавец обязуется организовать передачу Товаров Клиенту.</p>
                            <p class="mb-2">2.1.6. Продавец обязуется предоставить Клиенту всю необходимую информацию в соответствии с требованиями действующего законодательства РФ и настоящей Оферты.</p>

                            <h3 class="font-weight-semibold mt-4 mb-2">2.2. Права и обязанности Клиента:</h3>
                            <p class="mb-2">2.2.1. Клиент вправе требовать передачи Товара в порядке и на условиях, предусмотренным Офертой.</p>
                            <p class="mb-2">2.2.2. Клиент вправе требовать предоставления всей необходимой информации в соответствии с требованиями действующего законодательства РФ и настоящей Оферты.</p>
                            <p class="mb-2">2.2.3. Клиент вправе отказаться от Товара по основаниям, предусмотренным Соглашением и действующим законодательством Российской Федерации.</p>
                            <p class="mb-2">2.2.4. Клиент обязуется предоставить Продавцу достоверную информацию, необходимую для надлежащего исполнения Соглашения.</p>
                            <p class="mb-2">2.2.5. Клиент обязуется принять и оплатить Товар в соответствии с условиями Соглашения.</p>
                            <p class="mb-2">2.2.6. Клиент гарантирует, что все условия Соглашения ему понятны; Клиент принимает условия без оговорок, а также в полном объеме.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">3. СТОИМОСТЬ ТОВАРА, ПОРЯДОК ЗАКАЗА И ОПЛАТЫ</h2>
                            <p class="mb-2">3.1. Стоимость, а также порядок оплаты Товара определяется на основании сведений в Магазине Продавца</p>
                            <p class="mb-2">3.2. Выбор и заказ Товара осуществляется Клиентом в магазине продавца.</p>
                            <p class="mb-2">3.3. Для заказа Товара необходимо пополнить Баланс Клиента на минимальную сумму, необходимую для покупки Товара.</p>
                            <p class="mb-2">3.4. Продавец имеет право в одностороннем порядке изменить цену товара.</p>
                            <p class="mb-2">3.5. Обязательства Клиента по оплате Товара считаются исполненными с момента уменьшения баланса на стоимость товара.</p>
                            <p class="mb-2">3.6. Все покупки совершаются с Баланса Клиента.</p>
                            <p class="mb-2">3.7. Зачисление средств на Баланс Клиента производится в рублях РФ путем перевода денежной суммы на расчетный счет Продавца, в том числе с использованием платежных систем.</p>
                            <p class="mb-2">3.8. Все расчеты по Соглашению производятся в безналичном порядке.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">4. ГАРАНТИЯ, ОБМЕН И ВОЗВРАТ ТОВАРА</h2>
                            <p class="mb-2">4.1. Клиент вправе осуществить возврат (обмен) Продавцу Товара, приобретенный дистанционным способом, за исключением перечня товаров, не подлежащих обмену и возврату согласно действующему законодательству Российской Федерации. Условия, сроки и порядок возврата Товара надлежащего и ненадлежащего качества установлены в соответствии с требованиями Гражданского кодекса РФ, Закона РФ от 07.02.1992 N 2300-1 «О защите прав потребителей»; Правил, утвержденных Постановлением Правительства РФ от 31.12.2020 N 2463.</p>
                            <p class="mb-2">4.2. Требование Клиента об обмене либо о возврате Товара подлежит удовлетворению, если Товар не был в употреблении, сохранены его потребительские свойства и имеются доказательства приобретения его у Продавца.</p>
                            <p class="mb-2">4.3. Условия гарантии указаны в описании товара в Магазине Продавца.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">5. КОНФИДЕНЦИАЛЬНОСТЬ</h2>
                            <p class="mb-2">5.1. При реализации настоящего Соглашения Стороны обеспечивают конфиденциальность и безопасность персональных данных в соответствии с актуальной редакцией ФЗ от 27.07.2006 г. № 152-ФЗ «О персональных данных» и ФЗ от 27.07.2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации».</p>
                            <p class="mb-2">5.2. Стороны обязуются сохранять конфиденциальность информации, полученной в ходе исполнения настоящего Соглашения, и принять все возможные меры, чтобы предохранить полученную информацию от разглашения.</p>
                            <p class="mb-2">5.3. Под конфиденциальной информацией понимается любая информация, передаваемая Продавцом и Клиентом в процессе реализации Соглашения и подлежащая защите, исключения указаны ниже.</p>
                            <p class="mb-2">5.4. Такая информация может содержаться в предоставляемых Продавцом локальных нормативных актах, Соглашениях, письмах, отчетах, аналитических материалах, результатах исследований, схемах, графиках, спецификациях и других документах, оформленных как на бумажных, так и на электронных носителях.</p>
                            
                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">6. ФОРС-МАЖОР</h2>
                            <p class="mb-2">6.1. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Соглашению, если надлежащее исполнение оказалось невозможным вследствие непреодолимой силы, то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, под которыми понимаются: запретные действия властей, эпидемии, блокада, эмбарго, землетрясения, наводнения, пожары или другие стихийные бедствия.</p>
                            <p class="mb-2">6.2. В случае наступления этих обстоятельств Сторона обязана в течение 30 (Тридцати) рабочих дней уведомить об этом другую Сторону.</p>
                            <p class="mb-2">6.3. Документ, выданный уполномоченным государственным органом, является достаточным подтверждением наличия и продолжительности действия непреодолимой силы.</p>
                            <p class="mb-2">6.4. Если обстоятельства непреодолимой силы продолжают действовать более 60 (Шестидесяти) рабочих дней, то каждая Сторона вправе отказаться от настоящего Соглашения в одностороннем порядке.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
                            <p class="mb-2">7.1. В случае неисполнения и/или ненадлежащего исполнения своих обязательств по Соглашению, Стороны несут ответственность в соответствии с условиями настоящей Оферты.</p>

                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">8. СРОК ДЕЙСТВИЯ ОФЕРТЫ</h2>
                            <p class="mb-2">8.1. Оферта вступает в силу с момента размещения на Сайте Продавца и действует до момента её отзыва Продавцом.</p>
                            <p class="mb-2">8.2. Продавец оставляет за собой право внести изменения в условия Оферты и/или отозвать Оферту в любой момент по своему усмотрению. Сведения об изменении или отзыве Оферты доводятся до Клиента по выбору Продавца посредством размещения на сайте Продавца в сети «Интернет», в Личном кабинете Клиента, либо путем направления соответствующего уведомления на электронный или почтовый адрес, указанный Клиентом при заключении Соглашения или в ходе его исполнения.</p>
                            <p class="mb-2">8.3. Соглашение вступает в силу с момента Акцепта условий настоящей Оферты Клиентом и действует до полного исполнения Сторонами обязательств по Соглашению.</p>
                            <p class="mb-2">8.4. Изменения, внесенные Продавцом в Соглашения и опубликованные на сайте в форме актуализированной Оферты, считаются принятыми Клиентом в полном объеме.</p>
                            
                            <h2 class="font-weight-semibold mt-6 mb-3 darken-3">9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
                            <p class="mb-2">9.1. Соглашение, его Акцепт и исполнение регулируется действующим законодательством Российской Федерации. Все вопросы, не урегулированные настоящей Офертой или урегулированные не полностью, регулируются в соответствии с материальным правом Российской Федерации.</p>
                            <p class="mb-2">9.2. В случае возникновения спора, который может возникнуть между Сторонами в ходе исполнения ими своих обязательств по Соглашению, заключенному на условиях настоящей Оферты, Стороны обязаны урегулировать спор мирным путем до начала судебного разбирательства. Судебное разбирательство осуществляется в соответствии с законодательством Российской Федерации. Споры или разногласия, по которым Стороны не достигли договоренности, подлежат разрешению в соответствии с законодательством РФ. Досудебный порядок урегулирования спора является обязательным.</p>
                            <p class="mb-2">9.3. В качестве языка Соглашения, заключаемого на условиях настоящей Оферты, а также языка, используемого при любом взаимодействии Сторон (включая ведение переписки, предоставление требований / уведомлений / разъяснений, предоставление документов и т. д.), Стороны определили русский язык.</p>
                            <p class="mb-2">9.4. Все документы, подлежащие предоставлению в соответствии с условиями настоящей Оферты, должны быть составлены на русском языке либо иметь перевод на русский язык, удостоверенный в установленном порядке.</p>
                            <p class="mb-2">9.5. Бездействие одной из Сторон в случае нарушения условий настоящей Оферты не лишает права заинтересованной Стороны осуществлять защиту своих интересов позднее, а также не означает отказа от своих прав в случае совершения одной из Сторон подобных либо сходных нарушений в будущем.</p>
                            <p class="mb-2">9.6. Если на Сайте Продавца в сети «Интернет» или в Магазине есть ссылки на другие веб-сайты и материалы третьих лиц, такие ссылки размещены исключительно в целях информирования, и Продавец не имеет контроля в отношении содержания таких сайтов или материалов. Продавец не несет ответственность за любые убытки или ущерб, которые могут возникнуть в результате использования таких ссылок.</p>
                            <p class="mb-2">9.7. Подтверждение личности Клиента и принадлежности ему прав владения Учетной записью в Магазине осуществляется Клиентом путем предоставления оператору Магазина следующих документов:</p>
                            <ul class="pl-6 mb-2">
                                <li>Выписку/чеки из банка, подтверждающие пополнение Баланса Магазина.</li>
                                <li>Верификацию аккаунта Телеграмм, с которого запущен Магазин.</li>
                            </ul>

                            <v-divider class="my-4"></v-divider>
                            
                            <p class="font-weight-bold">ИП Рудаков Данил Андреевич</p>
                            <p class="font-weight-bold">ИНН 592061406274</p>
                            <p class="font-weight-bold">Телеграм-бот: <a href="https://t.me/pennoe" class="text--primary">https://t.me/pennoe</a></p>
                        </v-card-text>
                    </v-card>
                </v-col>
            </v-row>
        </v-container>
    </v-app>
</template>

<style>
    .bg {
        background-image: url('/images/bg.svg') !important;
        background-repeat: repeat
    }
</style>
